{
  "header":{
    "name": "Сергей",
    "surname": "Берсенев",
    "nav_1": "Главная",
    "nav_2": "Обо мне",
    "nav_3": "Резюме",
    "nav_4": "Портфолио",
    "nav_5": "Контакты"
  },
  "banner":{
    "hello": "Приветствую! Я - ",
    "profession": "Фронтенд-разработчик",
    "aboutProfession": "Работал над проектами Ташкентского аэропорта, платёжной системы GlobalPay, онлайн-казино + клона Google Play, учебного центра, онлайн кинотеатра и другими",
    "language": "Язык сайта:"
  },
  "aboutMe":{
    "title": "Коротко обо мне",
    "subtitle": "Биография, опыт, интересы",
    "title_2": "",
    "about": "Фронтенд-разработке я посвятил себя с 2020 года. В в декабре 2021 получил первое коммерческое предложение (LeadRate Москва), а уже в апреле 2022 приобрёл ценный опыт, работая фронтенд-разработчиком в Ташкенте. В 2023 году устроился работать в учебный центр IT Step, а сейчас я активно занимаюсь фрилансом и совершенствую свои навыки.",
    "about_2": "Имею высшее образование по техническому направлению. Ответственен. Обладаю хорошими коммуникативными навыками. Способен к самообучению, не боюсь разбираться в новых технологиях и фреймворках. В отдалённой перспективе расчитываю дорасти до позиции Senior.",
    "info_1": "Дата рождения:",
    "info_2": "Телефон:",
    "info_3": "Почта",
    "info_4": "Гражданство",
    "info_4_2": "Россия",
    "info_5": "Адрес",
    "info_5_2": "Ташкент, Узбекистан",
    "info_5_3": "Юнусабад 19",
    "info_6": "Языки",
    "info_6_2": "Рус, Англ (B2)"
  },
  "resume":{
    "title": "Резюме",
    "subtitle": "Опыт, образование, навыки",
    "experience": "Опыт",
    "education": "Образование",
    "skills": "Навыки",

    "experience_1":{
      "title":"TheDoctorsTeam",
      "description":"Онлайн кинотеатр"
    },
    "experience_2":{
      "title":"LeadRate, Global Solutions",
      "description":"Uzbekistan Airports, Global Pay и другие проекты"
    },
    "experience_3":{
      "title":"It-step Academy",
      "description":"Учебный центр"
    },
    "experience_4":{
      "title":"Фриланс",
      "description":"Преподавание, Проектная работа"
    },

    "education_1":{
      "title":"РТУ МИРЭА, Москва",
      "description":"Российский технологический институт. Бакалавриат"
    },
    "education_2":{
      "title":"Udemy",
      "description":"Англоязычная образовательная платформа"
    },
    "skils": "Навыки"
  },
  "portfolio":{
    "title": "Портфолио",
    "subtitle": "JavaScript, Typescript, React-Redux, Laravel (PHP), MySQL",
    "load": "Продолжить на GitHub",
    "role": "Личный вклад:"
  },
  "contacts":{
    "adress": "Адрес",
    "adress_info": "Юнусабад 19 Ташкент, Узбекистан",
    "phome": "Телефон",
    "mail": "Почта"

  },
  "footer":{
    "info": "Инфа"
  },
  "data":{
    "project_0":{
      "title":"Uzbekistan Airports",
      "short_description":"Новости, билеты, расписание",
      "description_long":"<div><p></p><p>Проект Uzbekistan Airports, предназначен для предоставления пользователям широкого спектра услуг, включая:</p><ul><li><strong>Онлайн-бронирование авиабилетов</strong></li><li><strong>Просмотр актуального расписания рейсов</strong></li><li><strong>Отслеживание статуса прилётов и вылетов в режиме реального времени</strong></li><li><strong>Ленту новостей, информацию о скидках и специальных предложениях</strong></li><li><strong>Раздел 'Тендеры' для публикации коммерческих предложений и запросов сотрудничества</strong></li></ul><p><strong>Ключевые особенности:</strong></p><ul><li><strong>Многоуровневая система администрирования:</strong> Реализована гибкая система управления сайтом с разграничением прав доступа для модераторов, администраторов и суперадминистраторов.</li><li><strong>Индивидуальная настройка новостных лент и тендеров:</strong> Реализована возможность для заказчика самостоятельно создавать новостные публикации и тендеры с произвольным оформлением, используя WYSIWYG-редактор. </li><li><strong>Статистика, охватывающая более сотни параметров:</strong> Разработано решение для удобного отслеживания статистики всего аэропорта, включая количество вылетов, прилётов, финансовые показатели, популярные направления, заполняемость рейсов и многое другое. Система имеет множество фильтров, позволяющих быстро и удобно получать необходимые данные.</li></ul><p><strong>Сложности и решения:</strong></p><p>Одной из технических сложностей стала реализация возможности для заказчика создавать контент с произвольным оформлением. Традиционно сайты имеют фиксированную разметку. Для решения данной задачи был использован WYSIWYG-редактор, преобразующий действия пользователя в валидную разметку и сохраняющий её в нужном формате. </p></div>",
      "my_role": "В рамках данного проекта я занимался разработкой панели администратора, включающей в себя следующие вкладки: отображение всей статистики аэропорта, управление публикациями новостей и тендеров (с использованием WYSIWYG-редактора), добавление и редактирование пользователей, а также их прав доступа, управление страницей сертификатов.",
      "web":"https://tashkent-airport.uz",
      "technologies":"React, chartJS, antd, wysywig, n18i, axios",
      "photo":{
        "photo_0_title":"Статистика",
        "photo_0_description":"Финансы, рейсы, направления",
        "photo_0_description_long":"Админ панель предосталвяет доступ к удобному просмотру статистики аэропорта более чем по сотне параметров",
        "photo_1_title":"Вылеты-прилёты",
        "photo_1_description":"Следите за статусом рейсов",
        "photo_1_description_long":"Посетители сайта могут отслеживать международные и внутренние рейсы в онланй-режиме, а также следить за статусами рейсов",
        "photo_2_title":"Личный кабинет",
        "photo_2_description":"Покупайте билеты онлайн",
        "photo_2_description_long":"Функционал личного кабинета позволяет пользователю бронировать и покупать билеты онлайн, а также получать уведомления о персональных предложениях",
        "photo_3_title":"Транзакции",
        "photo_3_description":"Полный отчёт и статистика",
        "photo_3_description_long":"Доступный администраторам полный отчёт по всем транзакциям помогает собирать и сортировать статистику с помощью десятка различных фильтров."
      }
    },
    "project_1":{
      "title":"Global Pay",
      "short_description":"Платёжная система",
      "description_long":"<div><p>Global Pay - платёжная система, предоставляющая безопасные решения для физических лиц, индивидуальных предпринимателей, а также банков и кредитных организаций.</p><p><strong>Ключевые возможности:</strong><ul><li><strong>Приём платежей через Telegram:</strong>  Удобство для пользователей и возможность интеграции с популярными мессенджерами.</li><li><strong>Совершение платежей:</strong> Поддержка широкого спектра платёжных инструментов, включая Uzcard, Humo, Visa и Mastercard.</li><li><strong>Отчётность по транзакциям:</strong>  Прозрачность и контроль над финансовыми операциями.</li><li><strong>Открытый API:</strong>  Гибкая интеграция с различными веб-сайтами, приложениями и Telegram-ботами.</li></ul></p><p><strong>Технологии:</strong><ul><li><strong>React:</strong>  Современный фреймворк для создания пользовательских интерфейсов.</li><li><strong>i18n:</strong>  Поддержка многоязыковой локализации.</li><li><strong>Ant Design:</strong>  Библиотека компонентов для создания визуально привлекательных интерфейсов.</li><li><strong>react-router-dom:</strong>  Библиотека для реализации маршрутизации в веб-приложениях.</li></ul></p><p><strong>Дополнительная информация:</strong><ul><li><strong>Разработка системы управления пользователями (User Management System):</strong>  Обеспечение безопасности и контроля над доступом к платёжным сервисам.</li><li><strong>Интеграция с платёжными шлюзами:</strong>  Безопасная обработка платежей от различных платёжных систем.</li></ul></p></div>",
      "my_role": "Написание документации для открытого API (Создание токена карты, запросы на детализацию платежей, оформление возвратов и т.д.) работа над разделом «Разработчикам» и панелью «Сервисы»",
      "web":"https://global.uz/global-pay",
      "technologies":"React, antd",
      "photo":{
        "photo_0_title":"Home",
        "photo_0_description":"Внешний вид сайта GlobalPay",
        "photo_0_description_long":"Внешний вид. Реализована анимация",
        "photo_1_title":"Меню",
        "photo_1_description":"Основные разделы навигации",
        "photo_1_description_long":"Основные разделы навигации",
        "photo_2_title":"Интеграция",
        "photo_2_description":"со сторонними сервисами",
        "photo_2_description_long":"Интеграция со сторонними сервисами",
        "photo_3_title":"Разработчикам",
        "photo_3_description":"Документация по открытому API",
        "photo_3_description_long":"Документации для открытого API (Создание токена карты, запросы на детализацию платежей, оформление возвратов и т.д.)"
      }
    },
    "project_2":{
      "title":"IT GO school",
      "short_description":"",
      "description_long":"<div><p>IT GO – проект многофункциональной онлайн-платформы для образовательного центра, совмещающая в себе функции сайта-визитки и LMS-системы.  </p><h5>Возможности платформы:</h5><ul><li><b>Для потенциальных студентов:</b><ul><li>Ознакомление с курсами и программами обучения</li><li>Подача заявки на обучение</li></ul></li><li><b>Для зарегистрированных студентов:</b><ul><li>Доступ к личному кабинету</li><li>Просмотр баланса счета</li><li>Отслеживание прогресса обучения</li><li>Доступ к учебным материалам</li><li>Выполнение и автоматическая проверка домашних заданий</li></ul></li><li><b>Для преподавателей:</b><ul><li>Запись и публикация уроков</li><li>Составление расписания занятий</li><li>Отслеживание посещаемости студентов</li><li>Проверка успеваемости и контроль знаний</li></ul></li><li><b>Для администраторов:</b><ul><li>Создание и редактирование курсов</li><li>Управление расписанием </li><li>Редактирование информации о студентах</li><li>Просмотр балансов и транзакций студентов</li></ul></li></ul><h5>Ключевая особенность:</h5><p>Одной из ключевых особенностей платформы стала интеграция редактора кода с системой автоматической проверки решений на базе Judge0.  Это  позволило студентам выполнять практические задания непосредственно на платформе и получать мгновенную обратную связь о корректности своего кода.</p><h5>Технологии:</h5><ul><li>Backend: Laravel (PHP), MySQL</li><li>Frontend: React, Ant Design</li><li>Система проверки кода: Judge0 </li></ul></div>",
      "my_role": "Полностью мой коммерческий проект",
      "web":"https://it-go.su",
      "technologies":"Laravel (PHP), MySQL, React, Ant Design, Система компиляции кода Judge0",
      "photo":{
        "photo_0_title":"Лендинг",
        "photo_0_description":"Удобная навигация дизайн",
        "photo_0_description_long":"Попадая на сайт, клиент может ознакомиться с текущими курсами, расписанием, ценами а также узнать основную информацию об учебном центре",
        "photo_1_title":"Редактор кода",
        "photo_1_description":"для проверки заданий онлайн",
        "photo_1_description_long":"Редактор кода - реализован с помощью Judge0, развёрнутом на сервере. Студенты могут выполнять задание в любое удобное время и мгоновенно получать резултаты",
        "photo_2_title":"Адмика",
        "photo_2_description":"удобное управление сайтом",
        "photo_2_description_long":"Курсы, цены, студенты, расписание, задания, стастистика, финансовые показатели, материалы занятий и многое другое...",
        "photo_3_title":"Интеграция",
        "photo_3_description":"с Telegram ботом (оповещения)",
        "photo_3_description_long":"Предусмотрена, но, к сожалению, на данный момент не функционирует :("
      }
    },
    "project_3":{
      "title":"TDT online cinema",
      "short_description":"",
      "description_long":"<div><p> TDT Online Cinema - это веб-приложение, предоставляющее пользователям доступ к обширной библиотеке популярных анимационных сериалов. Проект был разработан с фокусом на производительности и чистоте кода. </p><p><strong>Основные задачи и достижения:</strong><ul><li>Разработка динамического пользовательского интерфейса, обеспечивающего удобную навигацию по каталогу сериалов, просмотр информации о сериалах и эпизодах, а также управление воспроизведением видео.</li><li>Реализация системы поиска по названию сериала, жанру, году выпуска и другим параметрам.</li><li>Интеграция видеоплеера с возможностью выбора качества видео, субтитров и управления скоростью воспроизведения.</li><li>Оптимизация производительности веб-приложения для обеспечения быстрой загрузки и плавного воспроизведения видео даже при медленном интернет-соединении. </li></ul></p><p><strong>Технические детали:</strong> Особенностью проекта является его реализация на чистом JavaScript без использования сторонних библиотек и фреймворков. Такое решение было принято по желанию заказчика и позволило добиться максимальной производительности и полного контроля над кодовой базой.</p></div>",
      "my_role":"Вёрстка главной страницы и страницы проектов по заданным макетам. Создание необходимого функционала (слайдер, карусель, пагинация) на чистом JavaScript.",
      "web":"https://thedoctorteam.ru/",
      "technologies":"JavaScript, HTML, CSS",
      "photo":{
        "photo_0_title":"Фильтр",
        "photo_0_description":"по годам, жанрам и названиям",
        "photo_0_description_long":"Пример реализации фильра, позволяющего пользователям найти интересующий их фильм",
        "photo_1_title":"Личный кабинет",
        "photo_1_description":"Доуступен по подписке",
        "photo_1_description_long":"Сохраняйте подборки любимых фильмов и телесериалов",
        "photo_2_title":"Главная",
        "photo_2_description":"Новинки и популярные проекты",
        "photo_2_description_long":"На главной странице пользователь имеет возможность ознакомиться с новинками кино и проектами, набирающими популярность на сайте (по числу просмотров)",
        "photo_3_title":"Видеоплеер",
        "photo_3_description":"С синхронной сменой языка",
        "photo_3_description_long":"Страница просмотра и загрузки серии/фильма"
      }
    },
    "project_4":{
      "title":"Social Network",
      "short_description":"(Использовано рабочее название)",
      "description_long":"<div><p><strong>Статус проекта:</strong> В процессе разработки. Планируется запуск на коммерческой основе. </p><p><strong>Описание:</strong> Social Network - это проект современной социальной сети с расширенными возможностями для корпоративного взаимодействия. Помимо традиционного функционала (лента новостей, комментарии, репосты), платформа предложит инструменты для планирования мероприятий, организации встреч и совместной работы над проектами. Дата релиза пока не определена.</p><p><strong>Ключевые особенности:</strong></p><ul><li><strong>Гибридная платформа:</strong> Объединяет в себе функции социальной сети и инструменты для командной работы.</li><li><strong>Real-time взаимодействие:</strong> Реализовано WebSocket-соединение для мгновенного обмена сообщениями и создания динамичного опыта взаимодействия.</li><li><strong>Интеграция видео- и аудио-конференций:</strong> В ближайшем будущем будет введено удобное решение для проведения онлайн-встреч и виртуального сотрудничества.</li></ul></div>",
      "my_role":"Ментор и куратор Front-end разработки: отвечаю за создание архитектуры клиентской части приложения, используя React + Redux Toolkit, а также слежу за успешным выполнением студентом необходимых задач.",
      "web":"",
      "technologies":"JavaScript, HTML, CSS",
      "photo":{
        "photo_0_title":"Главная",
        "photo_0_description":"Лента новостей и профиль",
        "photo_0_description_long":"На главной странице пользователь может просматривать ленту, создавать посты, видеть последние активности друзей и новости",
        "photo_1_title":"События",
        "photo_1_description":"Планируйте и узнавайте",
        "photo_1_description_long":"Планируйте и узнавайте о грядущих событиях через Events прямо в приложении. Удобная сортировка предоставит вам возможности для гибкого планирования времни",
        "photo_2_title":"Сообщения",
        "photo_2_description":"Деловая и личная переписка",
        "photo_2_description_long":"Деловая и личная переписка",
        "photo_3_title":"Настройки",
        "photo_3_description":"Удобное управление учётной записью",
        "photo_3_description_long":"Удобное управление учётной записью. Настройки уведомалений и изменение личной информации."
      }
    },
    "project_5":{
      "title":"LeadRate",
      "short_description":"Медиабаинговое агентство",
      "description_long":"<div><p><strong>Задача и описание проекта: </strong></p><p>Разработка онлайн-казино с минимизацией рисков негативной индексаии поисковыми системами. Решение проблемы удаления приложения с PlayMarket</p><p><b> Решение:</b></p><ul><li><strong> Создание имитации PlayMarket: </strong> Разработана собственная копия PlayMarket, визуально неотличимая от оригинальной. Пользователи, переходящие по ссылке, получали впечатление, что скачивают официальное приложение, в то время как на самом деле скачивали наш PWA.</li><li><strong> Использование 'клоакинга':</strong> Реализована система 'клоакинга', позволяющая показывать различный контент поисковым ботам и реальным пользователям. Базы IP поисковых ботов использовались для предоставления безопасного контента, а реальным пользователям выдавалась страница казино со ссылками на подложный GooglePlay.</li></ul><br><strong>Результат:</strong><br><ul><li>Достигнуто стабильное функционирование онлайн-казино в обход официального PlayMarket.</li><li> Обеспечена положительная индексация поисковыми системами.</li></ul></p></div>",
      "my_role":"Реализовал систему клоакинга и подготовил её для связывания с базой IP-адресов web crawler. Принимал участиве в разработке и вёрстке некоторых элементов приложения и подложного Play Market. Решал проблему быстрой закачки PWA в сравнеии с .apk (фейковая загрузка с задержкой, основываясь на скорости интернета пользователя)",
      "technologies":"JavaScript, клоакинг, PWA"
    }
  }
}